benchmarks/dockerize/history/benchmark-aiohttp__2025-07-24.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiohttp_wrk-hello_1 ... 
Creating aiohttp_wrk-hello_1 ... done
Attaching to aiohttp_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     2.78ms    1.84ms  27.54ms   83.93%
wrk-hello_1  |     Req/Sec     3.89k     0.85k    9.23k    71.88%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    2.05ms
wrk-hello_1  |      75%    3.50ms
wrk-hello_1  |      90%    5.96ms
wrk-hello_1  |      99%    8.31ms
wrk-hello_1  |   930879 requests in 30.10s, 146.48MB read
wrk-hello_1  | Requests/sec:  30926.39
wrk-hello_1  | Transfer/sec:      4.87MB
aiohttp_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating aiohttp_wrk-order_1 ... 
Creating aiohttp_wrk-order_1 ... done
Attaching to aiohttp_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     4.72ms    2.32ms  30.48ms   67.28%
wrk-order_1  |     Req/Sec     2.15k   450.99     4.45k    85.32%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    4.55ms
wrk-order_1  |      75%    6.23ms
wrk-order_1  |      90%    7.73ms
wrk-order_1  |      99%   10.86ms
wrk-order_1  |   514494 requests in 30.10s, 122.17MB read
wrk-order_1  | Requests/sec:  17092.79
wrk-order_1  | Transfer/sec:      4.06MB
aiohttp_wrk-order_1 exited with code 0