benchmarks/dockerize/history/benchmark-aiohttp__2025-07-26.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiohttp_wrk-hello_1 ... 
Creating aiohttp_wrk-hello_1 ... done
Attaching to aiohttp_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     2.45ms    1.66ms  17.41ms   81.44%
wrk-hello_1  |     Req/Sec     4.41k     1.88k   11.91k    59.82%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    1.82ms
wrk-hello_1  |      75%    2.88ms
wrk-hello_1  |      90%    4.90ms
wrk-hello_1  |      99%    7.66ms
wrk-hello_1  |   1054176 requests in 30.10s, 165.88MB read
wrk-hello_1  | Requests/sec:  35023.07
wrk-hello_1  | Transfer/sec:      5.51MB
aiohttp_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiohttp_wrk-order_1 ... 
Creating aiohttp_wrk-order_1 ... done
Attaching to aiohttp_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     4.74ms    2.60ms  31.74ms   66.21%
wrk-order_1  |     Req/Sec     2.16k   430.22     4.83k    74.96%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    4.61ms
wrk-order_1  |      75%    6.34ms
wrk-order_1  |      90%    8.15ms
wrk-order_1  |      99%   12.09ms
wrk-order_1  |   516238 requests in 30.10s, 122.59MB read
wrk-order_1  | Requests/sec:  17153.06
wrk-order_1  | Transfer/sec:      4.07MB
aiohttp_wrk-order_1 exited with code 0