benchmarks/dockerize/history/benchmark-aiohttp__2025-12-21.log
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container aiohttp-wrk-hello-1  Creating
 Container aiohttp-wrk-hello-1  Created
Attaching to wrk-hello-1
wrk-hello-1  | Running 30s test @ http://gateway:8000/hello
wrk-hello-1  |   8 threads and 80 connections
wrk-hello-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-1  |     Latency     2.84ms    2.48ms  35.91ms   87.80%
wrk-hello-1  |     Req/Sec     4.17k     2.00k   11.99k    65.85%
wrk-hello-1  |   Latency Distribution
wrk-hello-1  |      50%    1.97ms
wrk-hello-1  |      75%    3.28ms
wrk-hello-1  |      90%    6.00ms
wrk-hello-1  |      99%   11.89ms
wrk-hello-1  |   998356 requests in 30.10s, 156.15MB read
wrk-hello-1  | Requests/sec:  33167.69
wrk-hello-1  | Transfer/sec:      5.19MB
wrk-hello-1 exited with code 0
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container aiohttp-wrk-order-1  Creating
 Container aiohttp-wrk-order-1  Created
Attaching to wrk-order-1
wrk-order-1  | Running 30s test @ http://gateway:8000/order
wrk-order-1  |   8 threads and 80 connections
wrk-order-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-1  |     Latency     4.59ms    2.73ms  39.89ms   68.55%
wrk-order-1  |     Req/Sec     2.26k   486.86     4.86k    73.33%
wrk-order-1  |   Latency Distribution
wrk-order-1  |      50%    4.31ms
wrk-order-1  |      75%    6.10ms
wrk-order-1  |      90%    8.13ms
wrk-order-1  |      99%   12.76ms
wrk-order-1  |   539066 requests in 30.02s, 127.50MB read
wrk-order-1  | Requests/sec:  17959.46
wrk-order-1  | Transfer/sec:      4.25MB
wrk-order-1 exited with code 0