benchmarks/dockerize/history/benchmark-aiozmq__2025-07-24.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiozmq_wrk-hello_1 ... 
Creating aiozmq_wrk-hello_1 ... done
Attaching to aiozmq_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     4.19ms    1.68ms  18.59ms   72.34%
wrk-hello_1  |     Req/Sec     2.40k   557.24     5.93k    69.59%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    3.94ms
wrk-hello_1  |      75%    4.67ms
wrk-hello_1  |      90%    6.56ms
wrk-hello_1  |      99%    8.65ms
wrk-hello_1  |   574066 requests in 30.09s, 90.33MB read
wrk-hello_1  | Requests/sec:  19076.34
wrk-hello_1  | Transfer/sec:      3.00MB
aiozmq_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiozmq_wrk-order_1 ... 
Creating aiozmq_wrk-order_1 ... done
Attaching to aiozmq_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency    10.35ms  534.20us  25.42ms   98.03%
wrk-order_1  |     Req/Sec     0.97k    26.99     1.16k    78.92%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%   10.30ms
wrk-order_1  |      75%   10.39ms
wrk-order_1  |      90%   10.49ms
wrk-order_1  |      99%   11.62ms
wrk-order_1  |   231912 requests in 30.02s, 56.40MB read
wrk-order_1  | Requests/sec:   7725.18
wrk-order_1  | Transfer/sec:      1.88MB
aiozmq_wrk-order_1 exited with code 0