benchmarks/dockerize/history/benchmark-aiozmq__2025-07-26.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiozmq_wrk-hello_1 ... 
Creating aiozmq_wrk-hello_1 ... done
Attaching to aiozmq_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     3.87ms    1.31ms  11.57ms   72.46%
wrk-hello_1  |     Req/Sec     2.60k   531.96    15.74k    65.39%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    4.11ms
wrk-hello_1  |      75%    4.63ms
wrk-hello_1  |      90%    5.52ms
wrk-hello_1  |      99%    6.88ms
wrk-hello_1  |   620708 requests in 30.10s, 97.67MB read
wrk-hello_1  | Requests/sec:  20621.64
wrk-hello_1  | Transfer/sec:      3.24MB
aiozmq_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating aiozmq_wrk-order_1 ... 
Creating aiozmq_wrk-order_1 ... done
Attaching to aiozmq_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency    10.45ms  532.48us  36.96ms   98.60%
wrk-order_1  |     Req/Sec     0.96k    25.95     1.33k    83.42%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%   10.42ms
wrk-order_1  |      75%   10.50ms
wrk-order_1  |      90%   10.60ms
wrk-order_1  |      99%   11.13ms
wrk-order_1  |   229745 requests in 30.03s, 55.87MB read
wrk-order_1  | Requests/sec:   7651.61
wrk-order_1  | Transfer/sec:      1.86MB
aiozmq_wrk-order_1 exited with code 0