benchmarks/dockerize/history/benchmark-aiozmq__2025-12-21.log
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container aiozmq-wrk-hello-1  Creating
 Container aiozmq-wrk-hello-1  Created
Attaching to wrk-hello-1
wrk-hello-1  | Running 30s test @ http://gateway:8000/hello
wrk-hello-1  |   8 threads and 80 connections
wrk-hello-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-1  |     Latency     3.18ms    1.48ms  17.56ms   56.01%
wrk-hello-1  |     Req/Sec     3.17k   690.12     6.53k    72.21%
wrk-hello-1  |   Latency Distribution
wrk-hello-1  |      50%    3.26ms
wrk-hello-1  |      75%    4.54ms
wrk-hello-1  |      90%    4.94ms
wrk-hello-1  |      99%    6.13ms
wrk-hello-1  |   757514 requests in 30.09s, 118.48MB read
wrk-hello-1  | Requests/sec:  25174.24
wrk-hello-1  | Transfer/sec:      3.94MB
wrk-hello-1 exited with code 0
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container aiozmq-wrk-order-1  Creating
 Container aiozmq-wrk-order-1  Created
Attaching to wrk-order-1
wrk-order-1  | Running 30s test @ http://gateway:8000/order
wrk-order-1  |   8 threads and 80 connections
wrk-order-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-1  |     Latency     9.03ms  502.52us  24.39ms   90.70%
wrk-order-1  |     Req/Sec     1.11k    38.39     1.25k    82.12%
wrk-order-1  |   Latency Distribution
wrk-order-1  |      50%    8.95ms
wrk-order-1  |      75%    9.06ms
wrk-order-1  |      90%    9.36ms
wrk-order-1  |      99%   10.19ms
wrk-order-1  |   265759 requests in 30.03s, 64.38MB read
wrk-order-1  | Requests/sec:   8850.15
wrk-order-1  | Transfer/sec:      2.14MB
wrk-order-1 exited with code 0