benchmarks/dockerize/history/benchmark-blacksheep__2025-07-24.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating blacksheep_wrk-hello_1 ... 
Creating blacksheep_wrk-hello_1 ... done
Attaching to blacksheep_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     3.59ms    1.46ms  34.53ms   71.84%
wrk-hello_1  |     Req/Sec     2.82k   448.60     8.66k    67.81%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    3.37ms
wrk-hello_1  |      75%    4.44ms
wrk-hello_1  |      90%    5.45ms
wrk-hello_1  |      99%    7.86ms
wrk-hello_1  |   672922 requests in 30.10s, 93.05MB read
wrk-hello_1  | Requests/sec:  22357.13
wrk-hello_1  | Transfer/sec:      3.09MB
blacksheep_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating blacksheep_wrk-order_1 ... 
Creating blacksheep_wrk-order_1 ... done
Attaching to blacksheep_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     7.23ms    3.67ms  46.28ms   70.76%
wrk-order_1  |     Req/Sec     1.41k   215.29     2.16k    67.00%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    6.68ms
wrk-order_1  |      75%    9.16ms
wrk-order_1  |      90%   12.17ms
wrk-order_1  |      99%   18.26ms
wrk-order_1  |   337836 requests in 30.02s, 67.01MB read
wrk-order_1  | Requests/sec:  11253.14
wrk-order_1  | Transfer/sec:      2.23MB
blacksheep_wrk-order_1 exited with code 0