benchmarks/dockerize/history/benchmark-blacksheep__2025-07-26.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating blacksheep_wrk-hello_1 ... 
Creating blacksheep_wrk-hello_1 ... done
Attaching to blacksheep_wrk-hello_1
wrk-hello_1  | Running 30s test @ http://gateway:8000/hello
wrk-hello_1  |   8 threads and 80 connections
wrk-hello_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1  |     Latency     3.69ms    1.65ms  28.22ms   72.49%
wrk-hello_1  |     Req/Sec     2.75k   443.37     4.62k    65.56%
wrk-hello_1  |   Latency Distribution
wrk-hello_1  |      50%    3.40ms
wrk-hello_1  |      75%    4.53ms
wrk-hello_1  |      90%    5.92ms
wrk-hello_1  |      99%    8.90ms
wrk-hello_1  |   658822 requests in 30.10s, 91.10MB read
wrk-hello_1  | Requests/sec:  21887.95
wrk-hello_1  | Transfer/sec:      3.03MB
blacksheep_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating blacksheep_wrk-order_1 ... 
Creating blacksheep_wrk-order_1 ... done
Attaching to blacksheep_wrk-order_1
wrk-order_1  | Running 30s test @ http://gateway:8000/order
wrk-order_1  |   8 threads and 80 connections
wrk-order_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1  |     Latency     7.03ms    3.12ms  35.30ms   68.29%
wrk-order_1  |     Req/Sec     1.44k   167.29     2.21k    69.21%
wrk-order_1  |   Latency Distribution
wrk-order_1  |      50%    6.84ms
wrk-order_1  |      75%    8.93ms
wrk-order_1  |      90%   11.06ms
wrk-order_1  |      99%   15.77ms
wrk-order_1  |   343741 requests in 30.03s, 68.19MB read
wrk-order_1  | Requests/sec:  11446.89
wrk-order_1  | Transfer/sec:      2.27MB
blacksheep_wrk-order_1 exited with code 0