benchmarks/dockerize/history/benchmark-blacksheep__2025-12-21.log
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container blacksheep-wrk-hello-1  Creating
 Container blacksheep-wrk-hello-1  Created
Attaching to wrk-hello-1
wrk-hello-1  | Running 30s test @ http://gateway:8000/hello
wrk-hello-1  |   8 threads and 80 connections
wrk-hello-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-1  |     Latency     2.23ms    1.39ms  34.72ms   87.20%
wrk-hello-1  |     Req/Sec     4.79k     1.22k   18.13k    66.57%
wrk-hello-1  |   Latency Distribution
wrk-hello-1  |      50%    1.88ms
wrk-hello-1  |      75%    2.53ms
wrk-hello-1  |      90%    3.74ms
wrk-hello-1  |      99%    8.41ms
wrk-hello-1  |   1144548 requests in 30.10s, 158.27MB read
wrk-hello-1  | Requests/sec:  38025.53
wrk-hello-1  | Transfer/sec:      5.26MB
wrk-hello-1 exited with code 0
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container blacksheep-wrk-order-1  Creating
 Container blacksheep-wrk-order-1  Created
Attaching to wrk-order-1
wrk-order-1  | Running 30s test @ http://gateway:8000/order
wrk-order-1  |   8 threads and 80 connections
wrk-order-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-1  |     Latency     5.02ms    2.75ms  36.04ms   71.61%
wrk-order-1  |     Req/Sec     2.05k   254.40     3.57k    76.25%
wrk-order-1  |   Latency Distribution
wrk-order-1  |      50%    4.50ms
wrk-order-1  |      75%    6.48ms
wrk-order-1  |      90%    8.69ms
wrk-order-1  |      99%   13.54ms
wrk-order-1  |   490188 requests in 30.03s, 97.24MB read
wrk-order-1  | Requests/sec:  16324.19
wrk-order-1  | Transfer/sec:      3.24MB
wrk-order-1 exited with code 0